import \
    sequence_sorting_module as ssm  # Длинное название модуля приводим к более

# компактному.

print("Развернём число! \nВвод: \n 179 \nВывод:\n", ssm.reverse_it(179))
print('-' * 61)
print("Выведем треугольную последовательность до заданного элемента! \nВвод: "
      "\n 5 \nВывод:")
print(ssm.triangle_sequence(5))
print('-' * 79)
print("Определим количество последовательностей из 0 и 1, где два нуля не "
      "стоят рядом! \nВвод: \nколичество нулей = 2, количество единиц = 2 "
      "\nВывод: \n", ssm.without_00(2, 2))
print('-' * 79)
print("Отсортируем матрицу!")
print(ssm.func_sort_matrix([
    [17, 38, 1, 25, 27, 1],
    [28, 21, 17, 6, 45, 44],
    [24, 36, 9, 2, 39, 1],
    [21, 18, 23, 46, 19, 22],
    [10, 14, 39, 5, 9, 31],
    [16, 26, 3, 32, 24, 34]], 6))
print('-' * 79)
print(help(ssm))
